@jacobbednarz I'm running next and still getting diffs, for example:

```
  # cloudflare_zero_trust_tunnel_cloudflared_config.server["au-pie-truenas"] will be updated in-place
  ~ resource "cloudflare_zero_trust_tunnel_cloudflared_config" "server" {
      ~ config     = {
          ~ ingress        = [
              ~ {
                  ~ origin_request = {
                      + access                 = (known after apply)
                        # (11 unchanged attributes hidden)
                    }
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ origin_request = {
                      + access                 = (known after apply)
                        # (10 unchanged attributes hidden)
                    }
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ origin_request = {
                      + access                 = (known after apply)
                        # (11 unchanged attributes hidden)
                    }
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  ~ origin_request = {
                      + access                 = (known after apply)
                        # (10 unchanged attributes hidden)
                    }
                    # (3 unchanged attributes hidden)
                },
              ~ {
                  + origin_request = (known after apply)
                    # (2 unchanged attributes hidden)
                },
            ]
          + origin_request = (known after apply)
          ~ warp_routing   = {
              ~ enabled = false -> (known after apply)
            } -> (known after apply)
        }
      ~ created_at = "2025-04-03T23:51:53Z" -> (known after apply)
        id         = "916dffd6-4c51-47b2-bc54-fc1a4c070217"
      ~ source     = "cloudflare" -> "local"
      ~ version    = 1 -> (known after apply)
        # (2 unchanged attributes hidden)
    }
```

```
resource "cloudflare_zero_trust_tunnel_cloudflared_config" "server" {
  for_each = local.output_servers

  account_id = cloudflare_account.default.id
  tunnel_id  = each.value.cloudflare_tunnel.id

  config = {
    ingress = concat(
      flatten([
        for k, service in local.filtered_services_enable_dns : [
          {
            hostname = cloudflare_dns_record.service[k].name
            path     = "/.well-known/acme-challenge/*"
            service  = "http://localhost"

            origin_request = {
              http_host_header = cloudflare_dns_record.service[k].name
            }
          },
          {
            hostname = cloudflare_dns_record.service[k].name
            service  = "https://localhost"

            origin_request = {
              no_tls_verify      = true
              origin_server_name = cloudflare_dns_record.service[k].name
            }
          }
        ] if service.enable_cloudflare_proxy && service.server == each.key
      ]),
      [
        {
          service = "http_status:503"
        }
      ]
    )
  }
}
```

```
resource "cloudflare_zero_trust_tunnel_cloudflared" "server" {
  for_each = local.filtered_servers_all

  account_id = cloudflare_account.default.id
  config_src = "cloudflare"
  name       = each.key
}
```